{
    "type": "APP",
    "description": "A project management tool facilitates team collaboration and project tracking. It offers features like task management, deadline tracking, milestone setting, and resource allocation. The platform supports real-time updates, communication, and reporting to enhance project efficiency and team productivity.",
    "embedding_string": "A project management tool that facilitates team collaboration and project tracking. It offers features like task management, deadline tracking, milestone setting, and resource allocation. Team members can view and manage tasks, track deadlines, access project information, and update their profiles. Admins oversee platform usage, manage user accounts, track project progress, and provide support. The platform supports real-time updates, communication, and reporting to enhance project efficiency and team productivity.",
    "actors": {
      "TeamMember": {
        "description": "The team member interacts with the project management tool to view and manage tasks, track deadlines, access project information, and update their profile.",
        "OnboardingFlow": {
          "description": "Guides new team members through setting up their profile, joining teams, and familiarizing themselves with the project management tools.",
          "Screens": {
            "LandingPage": {
              "description": "The first page that displays to team members, highlighting the app's collaborative features and a call to action to get started.",
              "sections": "1. HeroSection: Contains an overview of the app's features, Image and 'Get Started' button. Clicking the button navigates to the Welcome Screen.",
              "screenType": "DetailView"
            },
            "WelcomeScreen": {
              "description": "Introduces the platform's features to new team members with a welcoming image and text.",
              "sections": "This section contains a welcome message, Image and a 'Next' button that navigates to the Profile Setup Screen.",
              "screenType": "DetailView"
            },
            "ProfileSetupScreen": {
              "description": "Allows team members to set up their profile information.",
              "sections": "This section includes fields for entering profile details such as  including name, profile picture, and role.'Next' button that navigates to the login Screen.",
              "screenType": "DetailView"
            },
            "LoginScreen": {
              "description": "Allows team members to create a new account or log in to an existing one.",
              "sections": "This section contains fields for email and password with a 'Login' button.",
              "screenType": "LoginRegister"
            }
          }
        },
        "menuItems": {
          "Dashboard": {
            "description": "Provides an overview of sprint tasks, upcoming deadlines, recent activity, and project updates.",
            "screens": {
              "DashboardScreen": {
                "description": "Displays key project metrics, task status, recent updates, and upcoming deadlines.",
                "sections": 
                    "SprintTasks: Overview of current sprint tasks and their statuses.,
                    UpcomingDeadlines: List of approaching deadlines.,
                    RecentActivity: Log of recent project activities and updates.,
                    ProjectUpdates: Summary of recent updates from project managers or admins.","screenType": "Dashboard"
              }
            }
          },
          "Tasks": {
            "description": "Allows team members to view and manage their assigned tasks.",
            "screens": {
              "TaskListScreen": {
                "description": "Displays a list of tasks assigned to the team member.",
                "sections": 
                    "TaskOverview: List of tasks with their status, due dates, and priorities.,
                    TaskActions: 'Update' button which on click navigates to edit tasks view, 'Comment' and 'Attach file' icons to add comments, and attach files.","screenType": "ListView"
              }
            }
          },
          "Wiki": {
            "description": "Enables team members to share and access common knowledge about the projects and general information.",
            "screens": {
              "WikiScreen": {
                "description": "Provides a collaborative space for documenting project knowledge and general information.",
                "sections": 
                    "WikiPages: List of wiki pages with titles and summaries.,
                    PageEditor: 'Create' and 'Edit' buttons for creating and editing wiki pages.,
                    Search: Functionality to search for specific wiki pages or topics.","screenType": "ListView"
              }
            }
          },
          "Profile": {
            "description": "Offers options for team members to customize their app preferences and manage their profiles.",
            "screens": {
              "ProfileScreen": {
                "description": "Displays user profile information and settings.",
                "sections": 
                    "UserInfo: Displays user information such as name, email, and role with options to edit,
                    Preferences: Settings for app preferences like notification preferences and theme.,
                    SecuritySettings: Options to update password and enable two-factor authentication.","screenType": "Profile"
              }
            }
          }
        }
      },
      "OrganizationAdmin": {
        "description": "The organization admin oversees platform usage, manages user accounts and permissions, tracks project progress, and provides support.",
        "OnboardingFlow": {
          "description": "Guides new organization admins through setting up their organization, creating teams, and configuring project settings.",
          "screens": {
            "LandingPage": {
              "description": "The first page that displays to admins, highlighting the app's administrative features and a call to action to get started.",
              "sections": "1. HeroSection: Contains an overview of the app's features with a 'Get Started' button. Clicking the button navigates to the Welcome Screen.",
              "screenType": "DetailView"
            },
            "WelcomeScreen": {
              "description": "Introduces the platform's features to new admins with a welcoming image and text.",
              "sections": "This section contains a welcome message, Image and a 'Next' button that navigates to the Organization Setup Screen.",
              "screenType": "DetailView"
            },
            "OrganizationSetupScreen": {
              "description": "Allows admins to set up their organization information.",
              "sections": "This section includes fields for entering organization details including name, logo, and details. and a 'Next' button that navigates to the Team Creation Screen.",
              "screenType": "Form"
            },
            "TeamCreationScreen": {
              "description": "Allows admins to create and configure teams within the organization.",
              "sections": "This section includes options to create teams and a 'Next' button that navigates to the Project Settings Screen.",
              "screenType": "Form"
            },
            "ProjectSettingsScreen": {
              "description": "Allows admins to configure project settings.",
              "sections": "This section includes options for setting project parameters including permissions, roles, and integrations, and a 'Next' button that navigates to the login Screen.",
              "screenType": "Settings"
            },
            "LoginScreen": {
              "description": "Allows admins to create a new account or log in to an existing one.",
              "sections": "This section contains fields for email and password with a 'Login' button.",
              "screenType": "LoginRegister"
            }
          }
        },
        "menuItems": {
          "Dashboard": {
            "description": "Provides an overview of platform statistics, user activity, project analytics, and project health.",
            "screens": {
              "AdminDashboardScreen": {
                "description": "Displays critical metrics for platform usage, user activity, and project health.",
                "sections": 
                    "PlatformStatistics: Overview of platform usage metrics using KPI cards,
                    UserActivity: Real-time data on user activities.,
                    ProjectAnalytics: Detailed analytics on project performance and progress.,
                    HealthOverview: Summary of project health indicators.","screenType": "Dashboard"
              }
            }
          },
          "Users": {
            "description": "Enables the admin to manage user accounts and permissions.",
            "screens": {
              "UserManagementScreen": {
                "description": "Displays a list of users with options to manage accounts and permissions.",
                "sections": 
                    "UserList: List of users with options to edit or delete accounts.,
                    Permissions: Tools to manage user roles and access levels.,
                    TeamCreation: Options to create and manage teams.","screenType": "ListView"
              }
            }
          },
          "Projects": {
            "description": "Provides detailed insights and reports on projects.",
            "screens": {
              "ProjectManagementScreen": {
                "description": "Displays an overview of projects with options to manage them.",
                "sections": 
                    "ProjectList: List of projects with status, deadlines, and teams assigned.,
                    ProjectDetails: Detailed view of individual projects with progress and performance metrics using KPI cards.,
                    Actions: 'New projects','Assign teams','Update' to add new projects, assign teams, and update project details.","screenType": "ListView"
              }
            }
          },
          "Support": {
            "description": "Provides tools and resources to assist users with their issues.",
            "screens": {
              "SupportScreen": {
                "description": "Displays support tools and resources for user assistance.",
                "sections": 
                    "FAQ: List of frequently asked questions and answers.,
                    ContactSupport: Options to contact support via email or chat.,
                    UserGuides: Documentation and guides for platform usage.","screenType": "Support"
              }
            }
          },
          "Settings": {
            "description": "Allows the admin to set and manage user permissions and access levels.",
            "screens": {
              "SettingsScreen": {
                "description": "Displays options for managing platform and user settings.",
                "sections": 
                    "UserManagement: Tools for managing user accounts and permissions.,
                    PlatformSettings: Options to configure platform settings and preferences.,
                    NotificationSettings: Tools to manage notification preferences.,
                    SecuritySettings: Options for platform security, such as enabling two-factor authentication.,
                    SupportSettings: Tools for managing support resources and contact options.","screenType": "Settings"
              }
            }
          }
        }
      }
    }
  }